2D_Shear_Flow/0/alphat
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    fuel_inlet
    {
        type            calculated;
        value           uniform 0;
    }

    air_inlet
    {
        type            calculated;
        value           uniform 0;
    }

    outlet
    {
        type            calculated;
        value           uniform 0;
    }

    upperWall
    {
        type            calculated;
        value           uniform 0;
    }

    lowerWall
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }

    frontAndBack
    {
        type            empty;
    }
}
