2D_Shear_Flow/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    fuel_inlet
    {
        type            patch;
        nFaces          150;
        startFace       239300;
    }
    air_inlet
    {
        type            patch;
        nFaces          150;
        startFace       239450;
    }
    outlet
    {
        type            patch;
        nFaces          300;
        startFace       239600;
    }
    upperWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          400;
        startFace       239900;
    }
    lowerWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          400;
        startFace       240300;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          240000;
        startFace       240700;
    }
)

// ************************************************************************* //
