2D_Shear_Flow/constant/thermo.compressibleGas
species         5 ( NC12H26 O2 N2 CO2 H2O );

N2
{
    specie
    {
        molWeight       28.0134;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    ( 2.95257637 0.0013969004 -4.92631603e-07 7.86010195e-11 -4.60755204e-15 -924.423063 5.87156477 );
        lowCpCoeffs     ( 3.58256851 -0.000558781407 7.83391479e-07 8.73631719e-10 -7.49971666e-13 -1051.60018 2.75873431 );
    }
    transport
    {
        As              1.512e-06;
        Ts              120;
    }
    elements
    {
        N               2;
    }
}

CO2
{
    specie
    {
        molWeight       44.00995;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    ( 4.6365111 0.0027414569 -9.9589759e-07 1.6038666e-10 -9.1619857e-15 -49023.0378 -1.93362571 );
        lowCpCoeffs     ( 2.15396601 0.0106958703 -1.21826556e-05 8.60084283e-09 -2.73472847e-12 -48353.7808 10.7220601 );
    }
    transport
    {
        As              1.572e-06;
        Ts              240;
    }
    elements
    {
        C               1;
        O               2;
    }
}

O2
{
    specie
    {
        molWeight       31.9988;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    ( 3.66096065 0.000656365811 -1.41149627e-07 2.05797935e-11 -1.29913436e-15 -1214.90829 3.41609021 );
        lowCpCoeffs     ( 3.66627111 -0.00201629566 6.94873168e-06 -6.16244023e-09 1.7591906e-12 -1053.52472 4.12801194 );
    }
    transport
    {
        As              1.512e-06;
        Ts              120;
    }
    elements
    {
        O               2;
    }
}

NC12H26
{
    specie
    {
        molWeight       170.34102;
    }
    thermodynamics
    {
        Tlow            300;
        Thigh           5000;
        Tcommon         1396;
        highCpCoeffs    ( 39.1821375 0.0563066434 -1.92400364e-05 2.98494991e-09 -1.73089023e-13 -55201.9704 -175.385163 );
        lowCpCoeffs     ( -3.09648947 0.154500314 -0.00010963264 4.34902292e-08 -7.76618751e-12 -40296.3572 52.2480262 );
    }
    transport
    {
        As              1.512e-06;
        Ts              120;
    }
    elements
    {
        C               12;
        H               26;
    }
}

H2O
{
    specie
    {
        molWeight       18.01534;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    ( 2.6770389 0.0029731816 -7.7376889e-07 9.4433514e-11 -4.2689991e-15 -29886.2362 6.88231731 );
        lowCpCoeffs     ( 4.23584018 -0.00235035878 7.44852451e-06 -6.61473728e-09 2.24734749e-12 -30297.0623 -0.999620648 );
    }
    transport
    {
        As              1.512e-06;
        Ts              120;
    }
    elements
    {
        H               2;
        O               1;
    }
}
