2D_Shear_Flow/system/fvSchemes
FoamFile
{
    format ascii;
    class dictionary;
    object fvSchemes;
}

ddtSchemes
{
    default Euler;
}

gradSchemes
{
    default Gauss linear;
}

divSchemes
{
    default none;

    div(phi,U)       Gauss upwind;
    div(phi,Yi_h)    Gauss upwind;
    div(phi,K)       Gauss upwind;
    div(phi,k)       Gauss upwind;
    div(phi,epsilon) Gauss upwind;

    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default Gauss linear corrected;
}

interpolationSchemes
{
    default linear;
}

snGradSchemes
{
    default corrected;
}
