2D_Shear_Flow/system/setFieldsDict
FoamFile
{
    format ascii;
    class dictionary;
    location "system";
    object setFieldsDict;
}

defaultValues
{
    T       1700;
    U       (796 0 0);

    NC12H26 0;
    O2      0.233;
    N2      0.767;
    CO2     0;
    H2O     0;
}

zones
{
    fuel
    {
        type box;

        box (0 0 -0.0005)
            (1 0.15 0.0005);

        values
        {
            T       600;
            U       (173 0 0);

            NC12H26 1;
            O2      0;
            N2      0;
            CO2     0;
            H2O     0;
        }
    }

    air
    {
        type box;

        box (0 0.15 -0.0005)
            (1 0.3 0.0005);

        values
        {
            T       1700;
            U       (796 0 0);

            NC12H26 0;
            O2      0.233;
            N2      0.767;
            CO2     0;
            H2O     0;
        }
    }
}
